In [2]:
import pandas as pd
df = pd.DataFrame({'id':[100,101,102],'color':['red','blue','red']},columns={'id','color'},index=['a','b','c'])
df

  color   id
a   red  100
b  blue  101
c   red  102

In [3]:
pd.DataFrame([[100,'red'],[101,'blue'],[103,'red']],columns=['id','color'])

    id color
0  100   red
1  101  blue
2  103   red

In [4]:
import numpy as np
arr = np.random.rand(4,2)
arr

array([[0.76586106, 0.31299322],
       [0.43885175, 0.98749479],
       [0.94098549, 0.20650786],
       [0.80992566, 0.0543217 ]])

In [5]:
pd.DataFrame(arr,columns =['one','two'])

        one       two
0  0.765861  0.312993
1  0.438852  0.987495
2  0.940985  0.206508
3  0.809926  0.054322

In [6]:
GColumns = ['student','testScore']

In [7]:
pd.DataFrame({'student':np.arange(100,110,1), 'testScore':np.random.randint(60,101,10)}).set_index('student')

         testScore
student
100             83
101             81
102             80
103             84
104             93
105             99
106             96
107             63
108             84
109             76

In [8]:

s = pd.Series(['round','square'],index=['c','b'],name = 'shape')
s

c     round
b    square
Name: shape, dtype: object

In [9]:
df

  color   id
a   red  100
b  blue  101
c   red  102

In [10]:
pd.concat([df, s],axis =1,sort = False)

  color   id   shape
a   red  100     NaN
b  blue  101  square
c   red  102   round

In [11]:
people = {
    'First': ['Corey','Jane','John','Chris',np.nan, None, 'NA'],
    'Last': ['Schafer','Doe','Doe','Schafer',np.nan,np.nan, 'Missing'],
    'Email': ['CoreySchafer@gmail.com','JaneDoe@gmail.com','JohnDoe@gmail.com', None, np.nan,'Anonymous@gmail.com','NA'],
    'Age': ['33','55','63','36',None,None,'Missing']
}

In [12]:
df = pd.DataFrame(people)

df.replace('NA',np.nan,inplace=True)
df.replace('Missing',np.nan,inplace=True)

In [13]:
df

   First     Last                   Email   Age
0  Corey  Schafer  CoreySchafer@gmail.com    33
1   Jane      Doe       JaneDoe@gmail.com    55
2   John      Doe       JohnDoe@gmail.com    63
3  Chris  Schafer                    None    36
4    NaN      NaN                     NaN  None
5   None      NaN     Anonymous@gmail.com  None
6    NaN      NaN                     NaN   NaN

In [14]:
df.dropna() # if dropna(axis='index',how='any')

   First     Last                   Email Age
0  Corey  Schafer  CoreySchafer@gmail.com  33
1   Jane      Doe       JaneDoe@gmail.com  55
2   John      Doe       JohnDoe@gmail.com  63

In [15]:
df.dropna(axis='index',how='all')

   First     Last                   Email   Age
0  Corey  Schafer  CoreySchafer@gmail.com    33
1   Jane      Doe       JaneDoe@gmail.com    55
2   John      Doe       JohnDoe@gmail.com    63
3  Chris  Schafer                    None    36
5   None      NaN     Anonymous@gmail.com  None

In [16]:
df.dropna(axis ='index', how = 'any', subset = ['Last','Email'])

   First     Last                   Email Age
0  Corey  Schafer  CoreySchafer@gmail.com  33
1   Jane      Doe       JaneDoe@gmail.com  55
2   John      Doe       JohnDoe@gmail.com  63

In [17]:
df.isna()

   First   Last  Email    Age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [18]:
df.fillna(0)

   First     Last                   Email Age
0  Corey  Schafer  CoreySchafer@gmail.com  33
1   Jane      Doe       JaneDoe@gmail.com  55
2   John      Doe       JohnDoe@gmail.com  63
3  Chris  Schafer                       0  36
4      0        0                       0   0
5      0        0     Anonymous@gmail.com   0
6      0        0                       0   0

In [19]:
df['Age'] = df['Age'].astype(float)

In [20]:
df.dtypes

First     object
Last      object
Email     object
Age      float64
dtype: object

In [21]:
df['Age'].mean()

46.75